//
//  Timbre.swift
//  Solfegio
//
//  Created by Fedor Komov on 26.10.2026.
//

import Foundation

extension Int {
  var timbre: String {
    guard self ∈ Array(0...127) else { return "None" }
    let GM = ["Концертный рояль", "Яркое фортепиано", "Электронный рояль", "Расстроенное пианино из бара", "Электропиано 1", "Электропиано 2", "Клавесин", "Клавинет", "Челеста", "Колокольчики", "Музыкальная шкатулка", "Вибрафон", "Маримба", "Ксилофон", "Колокола", "Цимбалы", "Орган Хаммонда", "Перкуссионный орган", "Рок-орган", "Церковный орган", "Язычковый орган", "Аккордеон", "Гармоника", "Бандонеон", "Акустическая гитара 1", "Акустическая гитара 2", "Электрогитара (джаз)", "Электрогитара (чистый звук)", "Электрогитара (с приемом palm mute)", "Перегруженная электрогитара", "Дисторшн-электрогитара", "Гитарные флажолеты", "Акустический бас", "Электрическая бас-гитара (палец)", "Электрическая бас-гитара (медиатор)", "Безладовый бас", "Слэп-бас 1", "Слэп-бас 2", "Синтезаторный бас 1", "Синтезаторный бас 2", "Скрипка", "Альт", "Виолончель", "Контрабас", "Скрипичное тремоло", "Скрипичное пиццикато", "Арфа", "Литавры", "Струнный оркестр 1", "Струнный оркестр 2", "Синтезаторный оркестр 1", "Синтезаторный оркестр 2", "Хор, поющий «А»", "Голос, поющий «О»", "Синтезаторный хор", "Оркестровый акцент", "Труба", "Тромбон", "Туба", "Приглушенная труба", "Валторна", "Духовой оркестр", "Синтезаторные духовые 1", "Синтезаторные духовые 2", "Сопрано-саксофон", "Альт-саксофон", "Тенор-саксофон", "Баритон-саксофон", "Гобой", "Английский рожок", "Фагот", "Кларнет", "Пикколо", "Флейта", "Блокфлейта", "Флейта Пана", "Бутылочные горлышки", "Сякухати", "Свисток", "Окарина", "Ведущий голос 1 (меандр)", "Ведущий голос 2 (пилообразная волна)", "Ведущий голос 3 (каллиопа)", "Ведущий голос 4 (чиффер)", "Ведущий голос 5 (чаранг)", "Ведущий голос 6 (голос)", "Ведущий голос 7 (квинта)", "Ведущий голос 8 (бас и ведущий голос)", "Подголосок 1 (Нью Эйдж, или \"Фантасия\")", "Подголосок 2 (теплый звук)", "Подголосок 3 (полисинтезатор)", "Подголосок 4 (хор, или \"Space Voice\")", "Подголосок 5 (искривленный звук)", "Подголосок 6 (металлический звук)", "Подголосок 7 (гало)", "Подголосок 8 (свип)", "FX 1 (дождь)", "FX 2 (саундтрэк)", "FX 3 (кристалл)", "FX 4 (атмосфера)", "FX 5 (яркость)", "FX 6 (гоблины)", "FX 7 (эхо)", "FX 8 (сай-фай)", "Ситар", "Банджо", "Сямисэн", "Кото", "Калимба", "Волынка", "Фиддл", "Шахнай", "Медные колокольчики", "Агого", "Стальные барабаны", "Деревянная коробочка", "Тайко", "Мелодичный том-том", "Электробарабаны", "Реверсивная крэш-тарелка", "Шум гитарных струн", "Дыхание", "Шум прибоя", "Птичья трель", "Телефонный звонок", "Шум вертолета", "Аплодисменты", "Выстрел"]
    return GM[self]
  }
}
